#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:[0m
[0m[33mhttps://app.terraform.io/app/tianlu-terraform-org/news-search/runs/run-iQJUrAdA9u56k2wn[0m
[0m
Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
[0m[1mdata.google_container_engine_versions.gke_version: Reading...[0m[0m
[0m[1mgoogle_compute_network.vpc: Refreshing state... [id=projects/impactful-drive-450613-q8/global/networks/impactful-drive-450613-q8-vpc][0m
[0m[1mgoogle_compute_subnetwork.subnet: Refreshing state... [id=projects/impactful-drive-450613-q8/regions/europe-west4/subnetworks/impactful-drive-450613-q8-subnet][0m
[0m[1mgoogle_container_cluster.primary: Refreshing state... [id=projects/impactful-drive-450613-q8/locations/europe-west4-b/clusters/impactful-drive-450613-q8-gke][0m
[0m[1mdata.google_container_engine_versions.gke_version: Read complete after 0s [id=2025-03-20 15:30:44.365746329 +0000 UTC][0m
[0m[1mgoogle_container_node_pool.primary_nodes: Refreshing state... [id=projects/impactful-drive-450613-q8/locations/europe-west4-b/clusters/impactful-drive-450613-q8-gke/nodePools/impactful-drive-450613-q8-gke][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # google_container_cluster.primary[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_cluster" "primary" {
      [33m~[0m[0m cluster_ipv4_cidr                        = "10.204.0.0/14" -> (known after apply)
      [32m+[0m[0m datapath_provider                        = (known after apply)
      [32m+[0m[0m default_max_pods_per_node                = (known after apply)
      [33m~[0m[0m effective_labels                         = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [31m-[0m[0m enable_autopilot                         = false [90m-> null[0m[0m
      [33m~[0m[0m enable_intranode_visibility              = false -> (known after apply)
      [31m-[0m[0m enable_tpu                               = false [90m-> null[0m[0m
      [33m~[0m[0m endpoint                                 = "34.91.66.103" -> (known after apply)
      [33m~[0m[0m id                                       = "projects/impactful-drive-450613-q8/locations/europe-west4-b/clusters/impactful-drive-450613-q8-gke" -> (known after apply)
      [33m~[0m[0m label_fingerprint                        = "a9dc16a7" -> (known after apply)
      [33m~[0m[0m location                                 = "europe-west4-b" [33m->[0m[0m "europe-west4-c" [31m# forces replacement[0m[0m
      [33m~[0m[0m logging_service                          = "logging.googleapis.com/kubernetes" -> (known after apply)
      [33m~[0m[0m master_version                           = "1.31.6-gke.1020000" -> (known after apply)
      [33m~[0m[0m monitoring_service                       = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                                     = "impactful-drive-450613-q8-gke"
      [33m~[0m[0m network                                  = "projects/impactful-drive-450613-q8/global/networks/impactful-drive-450613-q8-vpc" [33m->[0m[0m "impactful-drive-450613-q8-vpc"
      [33m~[0m[0m networking_mode                          = "ROUTES" -> (known after apply)
      [33m~[0m[0m node_locations                           = [] -> (known after apply)
      [33m~[0m[0m node_version                             = "1.31.6-gke.1020000" -> (known after apply)
      [32m+[0m[0m operation                                = (known after apply)
      [32m+[0m[0m private_ipv6_google_access               = (known after apply)
      [33m~[0m[0m project                                  = "impactful-drive-450613-q8" -> (known after apply)
      [31m-[0m[0m resource_labels                          = {} [90m-> null[0m[0m
      [33m~[0m[0m self_link                                = "https://container.googleapis.com/v1/projects/impactful-drive-450613-q8/zones/europe-west4-b/clusters/impactful-drive-450613-q8-gke" -> (known after apply)
      [33m~[0m[0m services_ipv4_cidr                       = "10.207.240.0/20" -> (known after apply)
      [33m~[0m[0m subnetwork                               = "projects/impactful-drive-450613-q8/regions/europe-west4/subnetworks/impactful-drive-450613-q8-subnet" [33m->[0m[0m "impactful-drive-450613-q8-subnet"
      [33m~[0m[0m terraform_labels                         = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m tpu_ipv4_cidr_block                      = (known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m addons_config (known after apply)
      [31m-[0m[0m addons_config {
          [31m-[0m[0m gce_persistent_disk_csi_driver_config {
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
          [31m-[0m[0m network_policy_config {
              [31m-[0m[0m disabled = true [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m authenticator_groups_config (known after apply)

      [31m-[0m[0m binary_authorization {
          [31m-[0m[0m enabled         = false [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m cluster_autoscaling (known after apply)
      [31m-[0m[0m cluster_autoscaling {
          [31m-[0m[0m auto_provisioning_locations = [] [90m-> null[0m[0m
          [31m-[0m[0m autoscaling_profile         = "BALANCED" [90m-> null[0m[0m
          [31m-[0m[0m enabled                     = false [90m-> null[0m[0m
        }

      [33m~[0m[0m confidential_nodes (known after apply)

      [33m~[0m[0m control_plane_endpoints_config (known after apply)
      [31m-[0m[0m control_plane_endpoints_config {
          [31m-[0m[0m dns_endpoint_config {
              [31m-[0m[0m allow_external_traffic = true [90m-> null[0m[0m
              [31m-[0m[0m endpoint               = "gke-dba1e5ec62ca4e4a80fcad9811273980dd7a-998036415937.europe-west4-b.gke.goog" [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m cost_management_config (known after apply)

      [33m~[0m[0m database_encryption (known after apply)
      [31m-[0m[0m database_encryption {
          [31m-[0m[0m state    = "DECRYPTED" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m default_snat_status (known after apply)
      [31m-[0m[0m default_snat_status {
          [31m-[0m[0m disabled = false [90m-> null[0m[0m
        }

      [33m~[0m[0m enterprise_config (known after apply)
      [31m-[0m[0m enterprise_config {
          [31m-[0m[0m cluster_tier = "STANDARD" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m gateway_api_config (known after apply)

      [33m~[0m[0m identity_service_config (known after apply)

      [33m~[0m[0m ip_allocation_policy (known after apply)

      [33m~[0m[0m logging_config (known after apply)
      [31m-[0m[0m logging_config {
          [31m-[0m[0m enable_components = [
              [31m-[0m[0m "SYSTEM_COMPONENTS",
              [31m-[0m[0m "WORKLOADS",
            ] [90m-> null[0m[0m
        }

      [33m~[0m[0m master_auth (known after apply)
      [31m-[0m[0m master_auth {
          [31m-[0m[0m cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRYTlubjlFdmpwc1dyOGI2ZnZPcmczakFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRMU16VTJaakk1WWkxa05UVTBMVFJrTnpVdFlqQTFOQzB5TkdKbFpqSTRNVGhsTTJFdwpJQmNOTWpVd01qSTFNVFF6TWpJd1doZ1BNakExTlRBeU1UZ3hOVE15TWpCYU1DOHhMVEFyQmdOVkJBTVRKRFV6Ck5UWm1NamxpTFdRMU5UUXROR1EzTlMxaU1EVTBMVEkwWW1WbU1qZ3hPR1V6WVRDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUt3d281RVhwZDJPMDFvNVpwbXlQV1Nua2JhUXZVYlhRY1FXTHRzRQp2aSs0Ukp5aDdWSFVCelVYeitseTNrRC9CSjcwK2hEbklqaVN5aG1NYlEvc004NmlENm1aeFRsZWhWOGdPa0dUCm1PZmoxQlN0WjR2U1JkM295ZTNrT1czeUFXWkNYQVpKVHVmdVVHOVE2bmR1VmNHNWMxaUtLakhFU09CYjhRZ0sKaTYwRk1KQzhFMTRpOHVjdml4eUZsaVBkbnY2Vjk5bmRkbGRqM09DS1BVYkJRNFV2bkVDUzFsZWdYSFV6S1NrNgpVK21qZTBmamtxNEJJclRmZFNOWnRUV3Q2UU45bWUzMlpxV0ZsYlRsK29yQlNFNi9YdjV3aG4xK0lLVWJVd2IzCkZtOTFIcDdDVHZ5UFY3aGlPN0o0SjFKN0c3TnI3SklVY29hM09SczVhOHljQktpRWN6MDlGVVVOM1I3eDFHbVcKNUdrWGM4L0IxTnZRcE1MclRuNUliMlJCWkp2YWNnaWhCV1UwYkxsMmlmRzJZVDhMNGtya3ora21OYzIyeVpOMgpRb256MzhoSlExaVJUclVqcEZycGx4R200SUVDdDRHdi80cS93U2lla1ZQWUdxZ1lFSmlaM3dSbWVDYUdVT0t1CkJBSWhjZWlENGN6Q1F1cEZwV2tCMzY5ZERRSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVV1dDZINTFyUkhSUTVISm1SZlJpWU42VEdzT3d3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFIazZwZ3lkMFhveEhuZm5zcEE4OTJKTTg4bW1ZVkp0dVJLSjRJNDl5dUVlCkUyMmtZSktkVDM2VEJQanFxTks5VUJFL1dWcG5GSzkrVEdFMkZydEFWd2JPYjhtQVprSHpXalRVS2VMWnh6Q1MKTDltOFlPU0F3cDlKOW5qZVlQVlBWTHlLUlpXMGp0VjdLMThtemxFTG1vRGRodVBndmlKakQ2bUJMOFM5TGhOMQpMd2NDL05WY1NWRGpRQkIxVENVRzVrUkdqWDZVMHJrSXpyMjJyMmQ2b2pUVGxFV3B0V253RkZ6WHY0OEdMeXVYCitxdUxYcVkxcHFvN2RWRU9kMWdNcHNkVVIxQy94dlRVVWN3YnQ4dzFGVnJTYnIxaHNEMHJsajVSM3lDK1RuV2wKK3ZsZTlBR0NTSk5ORTlscGN6RCtYcnB3dmgwbHdVZzJ1WHd4S09YZzZjOWZRUFVNZ3NmUi9MczM3bnZFd05NMgpoSlNBZkl6MU5odk9kOUZKdnQ4em05ODhpYTQyWWdid0FKK1dTek1mMUhpUk5pdnZQbFU5bjNDcmMzVGZiN1ZtCkIxUzIwd0NuYldZelRMZ0NjTHZIT3NKUitmdTZmTHZMd0Z2a3YrU0JRZTZ3U0RHMmRKT3BDWW01Si9ORUtHZ1AKOVVEWjdYZmM4KzJsTVRFRnhPU0FBZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m client_certificate_config {
              [31m-[0m[0m issue_client_certificate = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m master_authorized_networks_config (known after apply)

      [33m~[0m[0m mesh_certificates (known after apply)

      [33m~[0m[0m monitoring_config (known after apply)
      [31m-[0m[0m monitoring_config {
          [31m-[0m[0m enable_components = [
              [31m-[0m[0m "SYSTEM_COMPONENTS",
              [31m-[0m[0m "DEPLOYMENT",
              [31m-[0m[0m "STATEFULSET",
              [31m-[0m[0m "STORAGE",
              [31m-[0m[0m "HPA",
              [31m-[0m[0m "POD",
              [31m-[0m[0m "DAEMONSET",
              [31m-[0m[0m "CADVISOR",
              [31m-[0m[0m "KUBELET",
            ] [90m-> null[0m[0m

          [31m-[0m[0m advanced_datapath_observability_config {
              [31m-[0m[0m enable_metrics = false [90m-> null[0m[0m
              [31m-[0m[0m enable_relay   = false [90m-> null[0m[0m
            }

          [31m-[0m[0m managed_prometheus {
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
        }

      [31m-[0m[0m network_policy {
          [31m-[0m[0m enabled  = false [90m-> null[0m[0m
          [31m-[0m[0m provider = "PROVIDER_UNSPECIFIED" [90m-> null[0m[0m
        }

      [33m~[0m[0m node_config (known after apply)
      [31m-[0m[0m node_config {
          [31m-[0m[0m disk_size_gb                = 100 [90m-> null[0m[0m
          [31m-[0m[0m disk_type                   = "pd-balanced" [90m-> null[0m[0m
          [31m-[0m[0m effective_taints            = [] [90m-> null[0m[0m
          [31m-[0m[0m enable_confidential_storage = false [90m-> null[0m[0m
          [31m-[0m[0m image_type                  = "COS_CONTAINERD" [90m-> null[0m[0m
          [31m-[0m[0m labels                      = {
              [31m-[0m[0m "env" = "impactful-drive-450613-q8"
            } [90m-> null[0m[0m
          [31m-[0m[0m local_ssd_count             = 0 [90m-> null[0m[0m
          [31m-[0m[0m logging_variant             = "DEFAULT" [90m-> null[0m[0m
          [31m-[0m[0m machine_type                = "n1-standard-1" [90m-> null[0m[0m
          [31m-[0m[0m metadata                    = {
              [31m-[0m[0m "disable-legacy-endpoints" = "true"
            } [90m-> null[0m[0m
          [31m-[0m[0m oauth_scopes                = [
              [31m-[0m[0m "https://www.googleapis.com/auth/logging.write",
              [31m-[0m[0m "https://www.googleapis.com/auth/monitoring",
            ] [90m-> null[0m[0m
          [31m-[0m[0m preemptible                 = false [90m-> null[0m[0m
          [31m-[0m[0m resource_labels             = {
              [31m-[0m[0m "goog-gke-node-pool-provisioning-model" = "on-demand"
            } [90m-> null[0m[0m
          [31m-[0m[0m resource_manager_tags       = {} [90m-> null[0m[0m
          [31m-[0m[0m service_account             = "default" [90m-> null[0m[0m
          [31m-[0m[0m spot                        = false [90m-> null[0m[0m
          [31m-[0m[0m storage_pools               = [] [90m-> null[0m[0m
          [31m-[0m[0m tags                        = [
              [31m-[0m[0m "gke-node",
              [31m-[0m[0m "impactful-drive-450613-q8-gke",
            ] [90m-> null[0m[0m
            [90m# (5 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m kubelet_config {
              [31m-[0m[0m allowed_unsafe_sysctls                 = [] [90m-> null[0m[0m
              [31m-[0m[0m container_log_max_files                = 0 [90m-> null[0m[0m
              [31m-[0m[0m cpu_cfs_quota                          = false [90m-> null[0m[0m
              [31m-[0m[0m image_gc_high_threshold_percent        = 0 [90m-> null[0m[0m
              [31m-[0m[0m image_gc_low_threshold_percent         = 0 [90m-> null[0m[0m
              [31m-[0m[0m insecure_kubelet_readonly_port_enabled = "TRUE" [90m-> null[0m[0m
              [31m-[0m[0m pod_pids_limit                         = 0 [90m-> null[0m[0m
                [90m# (5 unchanged attributes hidden)[0m[0m
            }

          [31m-[0m[0m shielded_instance_config {
              [31m-[0m[0m enable_integrity_monitoring = true [90m-> null[0m[0m
              [31m-[0m[0m enable_secure_boot          = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m node_pool (known after apply)
      [31m-[0m[0m node_pool {
          [31m-[0m[0m initial_node_count          = 2 [90m-> null[0m[0m
          [31m-[0m[0m instance_group_urls         = [
              [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/impactful-drive-450613-q8/zones/europe-west4-b/instanceGroupManagers/gke-impactful-drive--impactful-drive--aaa10cb5-grp",
            ] [90m-> null[0m[0m
          [31m-[0m[0m managed_instance_group_urls = [
              [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/impactful-drive-450613-q8/zones/europe-west4-b/instanceGroups/gke-impactful-drive--impactful-drive--aaa10cb5-grp",
            ] [90m-> null[0m[0m
          [31m-[0m[0m max_pods_per_node           = 0 [90m-> null[0m[0m
          [31m-[0m[0m name                        = "impactful-drive-450613-q8-gke" [90m-> null[0m[0m
          [31m-[0m[0m node_count                  = 2 [90m-> null[0m[0m
          [31m-[0m[0m node_locations              = [
              [31m-[0m[0m "europe-west4-b",
            ] [90m-> null[0m[0m
          [31m-[0m[0m version                     = "1.31.6-gke.1020000" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m management {
              [31m-[0m[0m auto_repair  = true [90m-> null[0m[0m
              [31m-[0m[0m auto_upgrade = true [90m-> null[0m[0m
            }

          [31m-[0m[0m node_config {
              [31m-[0m[0m disk_size_gb                = 100 [90m-> null[0m[0m
              [31m-[0m[0m disk_type                   = "pd-balanced" [90m-> null[0m[0m
              [31m-[0m[0m effective_taints            = [] [90m-> null[0m[0m
              [31m-[0m[0m enable_confidential_storage = false [90m-> null[0m[0m
              [31m-[0m[0m image_type                  = "COS_CONTAINERD" [90m-> null[0m[0m
              [31m-[0m[0m labels                      = {
                  [31m-[0m[0m "env" = "impactful-drive-450613-q8"
                } [90m-> null[0m[0m
              [31m-[0m[0m local_ssd_count             = 0 [90m-> null[0m[0m
              [31m-[0m[0m logging_variant             = "DEFAULT" [90m-> null[0m[0m
              [31m-[0m[0m machine_type                = "n1-standard-1" [90m-> null[0m[0m
              [31m-[0m[0m metadata                    = {
                  [31m-[0m[0m "disable-legacy-endpoints" = "true"
                } [90m-> null[0m[0m
              [31m-[0m[0m oauth_scopes                = [
                  [31m-[0m[0m "https://www.googleapis.com/auth/logging.write",
                  [31m-[0m[0m "https://www.googleapis.com/auth/monitoring",
                ] [90m-> null[0m[0m
              [31m-[0m[0m preemptible                 = false [90m-> null[0m[0m
              [31m-[0m[0m resource_labels             = {
                  [31m-[0m[0m "goog-gke-node-pool-provisioning-model" = "on-demand"
                } [90m-> null[0m[0m
              [31m-[0m[0m resource_manager_tags       = {} [90m-> null[0m[0m
              [31m-[0m[0m service_account             = "default" [90m-> null[0m[0m
              [31m-[0m[0m spot                        = false [90m-> null[0m[0m
              [31m-[0m[0m storage_pools               = [] [90m-> null[0m[0m
              [31m-[0m[0m tags                        = [
                  [31m-[0m[0m "gke-node",
                  [31m-[0m[0m "impactful-drive-450613-q8-gke",
                ] [90m-> null[0m[0m
                [90m# (5 unchanged attributes hidden)[0m[0m

              [31m-[0m[0m kubelet_config {
                  [31m-[0m[0m allowed_unsafe_sysctls                 = [] [90m-> null[0m[0m
                  [31m-[0m[0m container_log_max_files                = 0 [90m-> null[0m[0m
                  [31m-[0m[0m cpu_cfs_quota                          = false [90m-> null[0m[0m
                  [31m-[0m[0m image_gc_high_threshold_percent        = 0 [90m-> null[0m[0m
                  [31m-[0m[0m image_gc_low_threshold_percent         = 0 [90m-> null[0m[0m
                  [31m-[0m[0m insecure_kubelet_readonly_port_enabled = "TRUE" [90m-> null[0m[0m
                  [31m-[0m[0m pod_pids_limit                         = 0 [90m-> null[0m[0m
                    [90m# (5 unchanged attributes hidden)[0m[0m
                }

              [31m-[0m[0m shielded_instance_config {
                  [31m-[0m[0m enable_integrity_monitoring = true [90m-> null[0m[0m
                  [31m-[0m[0m enable_secure_boot          = false [90m-> null[0m[0m
                }
            }

          [31m-[0m[0m upgrade_settings {
              [31m-[0m[0m max_surge       = 1 [90m-> null[0m[0m
              [31m-[0m[0m max_unavailable = 0 [90m-> null[0m[0m
              [31m-[0m[0m strategy        = "SURGE" [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m node_pool_auto_config (known after apply)

      [33m~[0m[0m node_pool_defaults (known after apply)
      [31m-[0m[0m node_pool_defaults {
          [31m-[0m[0m node_config_defaults {
              [31m-[0m[0m insecure_kubelet_readonly_port_enabled = "FALSE" [90m-> null[0m[0m
              [31m-[0m[0m logging_variant                        = "DEFAULT" [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m notification_config (known after apply)
      [31m-[0m[0m notification_config {
          [31m-[0m[0m pubsub {
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }

      [31m-[0m[0m private_cluster_config {
          [31m-[0m[0m enable_private_endpoint     = false [90m-> null[0m[0m
          [31m-[0m[0m enable_private_nodes        = false [90m-> null[0m[0m
          [31m-[0m[0m private_endpoint            = "10.10.0.2" [90m-> null[0m[0m
          [31m-[0m[0m public_endpoint             = "34.91.66.103" [90m-> null[0m[0m
            [90m# (3 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m master_global_access_config {
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m release_channel (known after apply)
      [31m-[0m[0m release_channel {
          [31m-[0m[0m channel = "REGULAR" [90m-> null[0m[0m
        }

      [31m-[0m[0m secret_manager_config {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [33m~[0m[0m security_posture_config (known after apply)
      [31m-[0m[0m security_posture_config {
          [31m-[0m[0m mode               = "BASIC" [90m-> null[0m[0m
          [31m-[0m[0m vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" [90m-> null[0m[0m
        }

      [33m~[0m[0m service_external_ips_config (known after apply)
      [31m-[0m[0m service_external_ips_config {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [33m~[0m[0m vertical_pod_autoscaling (known after apply)

      [33m~[0m[0m workload_identity_config (known after apply)
    }

[1m  # google_container_node_pool.primary_nodes[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "primary_nodes" {
      [33m~[0m[0m id                          = "projects/impactful-drive-450613-q8/locations/europe-west4-b/clusters/impactful-drive-450613-q8-gke/nodePools/impactful-drive-450613-q8-gke" -> (known after apply)
      [33m~[0m[0m initial_node_count          = 2 -> (known after apply)
      [33m~[0m[0m instance_group_urls         = [
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/impactful-drive-450613-q8/zones/europe-west4-b/instanceGroupManagers/gke-impactful-drive--impactful-drive--aaa10cb5-grp",
        ] -> (known after apply)
      [33m~[0m[0m location                    = "europe-west4-b" [33m->[0m[0m "europe-west4-c" [31m# forces replacement[0m[0m
      [33m~[0m[0m managed_instance_group_urls = [
          [31m-[0m[0m "https://www.googleapis.com/compute/v1/projects/impactful-drive-450613-q8/zones/europe-west4-b/instanceGroups/gke-impactful-drive--impactful-drive--aaa10cb5-grp",
        ] -> (known after apply)
      [32m+[0m[0m max_pods_per_node           = (known after apply)
        name                        = "impactful-drive-450613-q8-gke"
      [32m+[0m[0m name_prefix                 = (known after apply)
      [33m~[0m[0m node_locations              = [
          [31m-[0m[0m "europe-west4-b",
        ] -> (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [33m~[0m[0m version                     = "1.31.6-gke.1020000" [33m->[0m[0m "1.31.5-gke.1233000"
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m management (known after apply)
      [31m-[0m[0m management {
          [31m-[0m[0m auto_repair  = true [90m-> null[0m[0m
          [31m-[0m[0m auto_upgrade = true [90m-> null[0m[0m
        }

      [33m~[0m[0m network_config (known after apply)

      [33m~[0m[0m node_config {
          [33m~[0m[0m disk_size_gb                = 100 -> (known after apply)
          [33m~[0m[0m disk_type                   = "pd-balanced" -> (known after apply)
          [33m~[0m[0m effective_taints            = [] -> (known after apply)
          [31m-[0m[0m enable_confidential_storage = false [90m-> null[0m[0m
          [33m~[0m[0m image_type                  = "COS_CONTAINERD" -> (known after apply)
          [33m~[0m[0m local_ssd_count             = 0 -> (known after apply)
          [33m~[0m[0m logging_variant             = "DEFAULT" -> (known after apply)
          [33m~[0m[0m machine_type                = "n1-standard-1" [33m->[0m[0m "e2-micro"
          [32m+[0m[0m min_cpu_platform            = (known after apply)
          [31m-[0m[0m resource_labels             = {
              [31m-[0m[0m "goog-gke-node-pool-provisioning-model" = "on-demand"
            } [90m-> null[0m[0m
          [31m-[0m[0m resource_manager_tags       = {} [90m-> null[0m[0m
          [33m~[0m[0m service_account             = "default" -> (known after apply)
          [31m-[0m[0m storage_pools               = [] [90m-> null[0m[0m
            tags                        = [
                "gke-node",
                "impactful-drive-450613-q8-gke",
            ]
            [90m# (9 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m confidential_nodes (known after apply)

          [33m~[0m[0m gcfs_config (known after apply)

          [33m~[0m[0m guest_accelerator (known after apply)

          [33m~[0m[0m kubelet_config (known after apply)
          [31m-[0m[0m kubelet_config {
              [31m-[0m[0m allowed_unsafe_sysctls                 = [] [90m-> null[0m[0m
              [31m-[0m[0m container_log_max_files                = 0 [90m-> null[0m[0m
              [31m-[0m[0m cpu_cfs_quota                          = false [90m-> null[0m[0m
              [31m-[0m[0m image_gc_high_threshold_percent        = 0 [90m-> null[0m[0m
              [31m-[0m[0m image_gc_low_threshold_percent         = 0 [90m-> null[0m[0m
              [31m-[0m[0m insecure_kubelet_readonly_port_enabled = "TRUE" [90m-> null[0m[0m
              [31m-[0m[0m pod_pids_limit                         = 0 [90m-> null[0m[0m
                [90m# (5 unchanged attributes hidden)[0m[0m
            }

          [33m~[0m[0m shielded_instance_config (known after apply)
          [31m-[0m[0m shielded_instance_config {
              [31m-[0m[0m enable_integrity_monitoring = true [90m-> null[0m[0m
              [31m-[0m[0m enable_secure_boot          = false [90m-> null[0m[0m
            }

          [33m~[0m[0m workload_metadata_config (known after apply)
        }

      [33m~[0m[0m upgrade_settings (known after apply)
      [31m-[0m[0m upgrade_settings {
          [31m-[0m[0m max_surge       = 1 [90m-> null[0m[0m
          [31m-[0m[0m max_unavailable = 0 [90m-> null[0m[0m
          [31m-[0m[0m strategy        = "SURGE" [90m-> null[0m[0m
        }
    }

[1mPlan:[0m 2 to add, 0 to change, 2 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m kubernetes_cluster_host = "34.91.66.103" -> (known after apply)

```

</details>

*Pusher: @tianshuailu, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*